"""
根据用户输入的年份来判断是否是闰年小脚本，此脚本要求用户输入的年份不能低于1700年，但同时不能大于2500年。低于1700年和高于2500年;
用户都将收到超出计算范围的错误提示，程序退出。该程序主要是利用if-else条件判断实现用户输入信息的反馈。
"""
year = input("请输入你想计算的年份：")


# 判断年份输入是否低于1700年或大于2500年
def run():
    if 2500 > int(year) > 1700:
        if int(year) % 4 == 0:
            print(f'{year}'"年是闰年。")
        else:
            print(f'{year}'"年不是闰年。")
    else:
        print("错误！超出计算范围，程序退出。输入的数字应是1700-2500之间的整数。")


# 根据输入判断是否输入的是数字，如果不是则给出错误提示并退出，如果是数字则进行第二层判断
if year.isdigit():
    run()
else:
    print("输入错误，请输入正确的数值。")
